Enums/ТипыИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФондETF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктурныйПродукт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опцион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИнструментыБрокера/Ext/Module.bsl
// ОбщийМодуль.ИнструментыБрокера (сервер, экспорт)
// Маппинг instrumentType (строка/enum-name из API) -> Перечисление.ТипИнструмента

&НаСервере
Функция ТипИнструментаПоInstrumentType(Знач InstrumentTypeСервиса) Экспорт
	
	Перем КэшНеизвестныхТипов;
	Перем КэшСоответствияInstrumentType;
	
	// Приводим к строке и нормализуем
	ТипСтрокой = "";
	Если InstrumentTypeСервиса <> Неопределено Тогда
		ТипСтрокой = ВРег(СокрЛП(Строка(InstrumentTypeСервиса)));
	КонецЕсли;
	
	// Пусто -> НеОпределено
	Если ПустаяСтрока(ТипСтрокой) Тогда
		Возврат Перечисления.ТипыИнструментов.Неопределено;
	КонецЕсли;
	
	СоответствиеInstrumentType = СоответствиеInstrumentType(КэшСоответствияInstrumentType);
	НайденноеЗначение = СоответствиеInstrumentType.Получить(ТипСтрокой);
	Если НайденноеЗначение <> Неопределено Тогда
		Возврат НайденноеЗначение;
	КонецЕсли;
	
	// Неизвестный тип: возвращаем НеОпределено и логируем
	ЗаписатьНеизвестныйТипИнструмента(ТипСтрокой, КэшНеизвестныхТипов);
	Возврат Перечисления.ТипыИнструментов.Неопределено;
	
КонецФункции

&НаСервере
Функция СоответствиеInstrumentType(КэшСоответствияInstrumentType = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КэшСоответствияInstrumentType) Тогда
		
		КэшСоответствияInstrumentType = Новый Соответствие;
		
		//КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_UNSPECIFIED", Перечисления.ТипыИнструментов.Неопределено);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_BOND",         Перечисления.ТипыИнструментов.Облигация);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_SHARE",        Перечисления.ТипыИнструментов.Акция);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_CURRENCY",     Перечисления.ТипыИнструментов.Валюта);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_ETF",          Перечисления.ТипыИнструментов.ФондETF);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_FUTURES",      Перечисления.ТипыИнструментов.Фьючерс);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_SP",           Перечисления.ТипыИнструментов.СтруктурныйПродукт);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_OPTION",       Перечисления.ТипыИнструментов.Опцион);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_CLEARING_CERTIFICATE", Перечисления.ТипыИнструментов.КлиринговыйСертификат);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_INDEX",        Перечисления.ТипыИнструментов.Индекс);
		КэшСоответствияInstrumentType.Вставить("INSTRUMENT_TYPE_COMMODITY",    Перечисления.ТипыИнструментов.Товар);
		
	КонецЕсли;
	
	Возврат КэшСоответствияInstrumentType;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНеизвестныйТипИнструмента(Знач ТипСтрокой, КэшНеизвестныхТипов)
	// Минимальный лог. Подстрой под свой механизм логирования/регистра "Импорт данных брокера".
	// Важно: лог должен быть "без шума" — один раз на тип, иначе засорит.
	
	// Простейший дедуп по типу на время сеанса
	Если НЕ ЗначениеЗаполнено(КэшНеизвестныхТипов) Тогда
		КэшНеизвестныхТипов = Новый Соответствие;
	КонецЕсли;
	
	Если КэшНеизвестныхТипов.Получить(ТипСтрокой) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	КэшНеизвестныхТипов.Добавить(ТипСтрокой);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Неизвестный instrumentType из API: " + ТипСтрокой + ". Проставлен ТипИнструмента=НеОпределено. Добавь маппинг.";
	Сообщение.Сообщить();
	
КонецПроцедуры

// Вверху модуля:
// Перем КэшНеизвестныхТипов;


//InstrumentType
//Name	Number	Description
//INSTRUMENT_TYPE_UNSPECIFIED	0	Тип инструмента не определен
//INSTRUMENT_TYPE_BOND	1	Облигация
//INSTRUMENT_TYPE_SHARE	2	Акция
//INSTRUMENT_TYPE_CURRENCY	3	Валюта
//INSTRUMENT_TYPE_ETF	4	Exchange-traded fund
//INSTRUMENT_TYPE_FUTURES	5	Фьючерс
//INSTRUMENT_TYPE_SP	6	Структурная нота
//INSTRUMENT_TYPE_OPTION	7	Опцион
//INSTRUMENT_TYPE_CLEARING_CERTIFICATE	8	Clearing certificate
//INSTRUMENT_TYPE_INDEX	9	Индекс
//INSTRUMENT_TYPE_COMMODITY	10	Товар


// ОбщийМодуль.ИнструментыБрокера (сервер, экспорт)

&НаСервере
Функция InstrumentTypeСервисаПоТипуИнструмента(Знач ТипИнструмента1С) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипИнструмента1С) Тогда
		Возврат "INSTRUMENT_TYPE_UNSPECIFIED";
	КонецЕсли;
	
	Если ТипИнструмента1С = Перечисления.ТипыИнструментов.Неопределено Тогда
		Возврат "INSTRUMENT_TYPE_UNSPECIFIED";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Облигация Тогда
			Возврат "INSTRUMENT_TYPE_BOND";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Акция Тогда
			Возврат "INSTRUMENT_TYPE_SHARE";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Валюта Тогда
			Возврат "INSTRUMENT_TYPE_CURRENCY";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.ФондETF Тогда
			Возврат "INSTRUMENT_TYPE_ETF";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Фьючерс Тогда
			Возврат "INSTRUMENT_TYPE_FUTURES";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.СтруктурныйПродукт Тогда
			Возврат "INSTRUMENT_TYPE_SP";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Опцион Тогда
			Возврат "INSTRUMENT_TYPE_OPTION";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.КлиринговыйСертификат Тогда
			Возврат "INSTRUMENT_TYPE_CLEARING_CERTIFICATE";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Индекс Тогда
			Возврат "INSTRUMENT_TYPE_INDEX";
			
		ИначеЕсли ТипИнструмента1С = Перечисления.ТипыИнструментов.Товар Тогда
			Возврат "INSTRUMENT_TYPE_COMMODITY";
			
		Иначе
			// На случай расширения перечисления в будущем
			Возврат "INSTRUMENT_TYPE_UNSPECIFIED";
			
	КонецЕсли;
	
КонецФункции
